zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_dac12.h
/* DAC12_FSUB_0 Bits */
/* DAC12_FSUB_0[CHANID] Bits */
#define DAC12_FSUB_0_CHANID_OFS                  (0)                             /* !< CHANID Offset */
#define DAC12_FSUB_0_CHANID_MASK                 ((uint32_t)0x00007FFFU)         /* !< 0 = disconnected. others =
                                                                                    connected to channel_ID = CHANID. */
#define DAC12_FSUB_0_CHANID_MNIMUM               ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define DAC12_FSUB_0_CHANID_UNCONNECTED          ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define DAC12_FSUB_0_CHANID_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* DAC12_FPUB_1 Bits */
/* DAC12_FPUB_1[CHANID] Bits */
#define DAC12_FPUB_1_CHANID_OFS                  (0)                             /* !< CHANID Offset */
#define DAC12_FPUB_1_CHANID_MASK                 ((uint32_t)0x00007FFFU)         /* !< 0 = disconnected. others =
                                                                                    connected to channel_ID = CHANID. */
#define DAC12_FPUB_1_CHANID_MNIMUM               ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define DAC12_FPUB_1_CHANID_UNCONNECTED          ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define DAC12_FPUB_1_CHANID_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* DAC12_EVT_MODE Bits */
/* DAC12_EVT_MODE[INT0_CFG] Bits */
#define DAC12_EVT_MODE_INT0_CFG_OFS              (0)                             /* !< INT0_CFG Offset */
#define DAC12_EVT_MODE_INT0_CFG_MASK             ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT][0] */
#define DAC12_EVT_MODE_INT0_CFG_DISABLE          ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define DAC12_EVT_MODE_INT0_CFG_SOFTWARE         ((uint32_t)0x00000001U)         /* !< Event handled by software. Software
                                                                                    must clear the associated RIS flag. */
#define DAC12_EVT_MODE_INT0_CFG_HARDWARE         ((uint32_t)0x00000002U)         /* !< Event handled by hardware. The
                                                                                    hardware (another module) clears
                                                                                    automatically the associated RIS
                                                                                    flag. */
/* DAC12_EVT_MODE[EVT1_CFG] Bits */
#define DAC12_EVT_MODE_EVT1_CFG_OFS              (2)                             /* !< EVT1_CFG Offset */
#define DAC12_EVT_MODE_EVT1_CFG_MASK             ((uint32_t)0x0000000CU)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT][0] */
#define DAC12_EVT_MODE_EVT1_CFG_DISABLE          ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define DAC12_EVT_MODE_EVT1_CFG_SOFTWARE         ((uint32_t)0x00000004U)         /* !< Event handled by software. Software
                                                                                    must clear the associated RIS flag. */
#define DAC12_EVT_MODE_EVT1_CFG_HARDWARE         ((uint32_t)0x00000008U)         /* !< Event handled by hardware. The
                                                                                    hardware (another module) clears
                                                                                    automatically the associated RIS
                                                                                    flag. */

/* DAC12_DESC Bits */
/* DAC12_DESC[MINREV] Bits */
#define DAC12_DESC_MINREV_OFS                    (0)                             /* !< MINREV Offset */
#define DAC12_DESC_MINREV_MASK                   ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
/* DAC12_DESC[MAJREV] Bits */
#define DAC12_DESC_MAJREV_OFS                    (4)                             /* !< MAJREV Offset */
#define DAC12_DESC_MAJREV_MASK                   ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
/* DAC12_DESC[FEATUREVER] Bits */
#define DAC12_DESC_FEATUREVER_OFS                (12)                            /* !< FEATUREVER Offset */
#define DAC12_DESC_FEATUREVER_MASK               ((uint32_t)0x0000F000U)         /* !< Feature Set for the module
                                                                                    *instance* */
/* DAC12_DESC[MODULEID] Bits */
#define DAC12_DESC_MODULEID_OFS                  (16)                            /* !< MODULEID Offset */
#define DAC12_DESC_MODULEID_MASK                 ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */

/* DAC12_CTL0 Bits - DAC控制寄存器0(数据格式/使能/分辨率) */
/* DAC12_CTL0[DFM] Bits - 数据格式模式 */
#define DAC12_CTL0_DFM_OFS                       (16)                            /* !< DFM Offset */
#define DAC12_CTL0_DFM_MASK                      ((uint32_t)0x00010000U)         /* !< This bit defines the DAC input data
                                                                                    format. */
#define DAC12_CTL0_DFM_BINARY                    ((uint32_t)0x00000000U)         /* !< Straight binary */
#define DAC12_CTL0_DFM_TWOS_COMP                 ((uint32_t)0x00010000U)         /* !< Twos complement */
/* DAC12_CTL0[ENABLE] Bits - DAC模块使能 */
#define DAC12_CTL0_ENABLE_OFS                    (0)                             /* !< ENABLE Offset */
#define DAC12_CTL0_ENABLE_MASK                   ((uint32_t)0x00000001U)         /* !< This bit enables the DAC module. */
#define DAC12_CTL0_ENABLE_CLR                    ((uint32_t)0x00000000U)         /* !< DAC is disabled */
#define DAC12_CTL0_ENABLE_SET                    ((uint32_t)0x00000001U)         /* !< DAC is enabled */
/* DAC12_CTL0[RES] Bits - DAC分辨率选择 */
#define DAC12_CTL0_RES_OFS                       (8)                             /* !< RES Offset */
#define DAC12_CTL0_RES_MASK                      ((uint32_t)0x00000100U)         /* !< These bits define the DAC output
                                                                                    voltage resolution. */
#define DAC12_CTL0_RES__8BITS                    ((uint32_t)0x00000000U)         /* !< 8-bits resolution */
#define DAC12_CTL0_RES__12BITS                   ((uint32_t)0x00000100U)         /* !< 12-bit resolution */

/* DAC12_CTL1 Bits - DAC控制寄存器1(放大器/参考电压/输出选择) */
/* DAC12_CTL1[AMPEN] Bits - 输出放大器使能 */
#define DAC12_CTL1_AMPEN_OFS                     (0)                             /* !< AMPEN Offset */
#define DAC12_CTL1_AMPEN_MASK                    ((uint32_t)0x00000001U)         /* !< AMP_EN - output amplifier enabled
                                                                                    or disabled 0 : disabled  1 : enabled */
#define DAC12_CTL1_AMPEN_DISABLE                 ((uint32_t)0x00000000U)         /* !< disable */
#define DAC12_CTL1_AMPEN_ENABLE                  ((uint32_t)0x00000001U)         /* !< enable */
/* DAC12_CTL1[REFSP] Bits - 正参考电压源选择 */
#define DAC12_CTL1_REFSP_OFS                     (8)                             /* !< REFSP Offset */
#define DAC12_CTL1_REFSP_MASK                    ((uint32_t)0x00000100U)         /* !< This bit selects the DAC voltage
                                                                                    reference source + input. */
#define DAC12_CTL1_REFSP_VDDA                    ((uint32_t)0x00000000U)         /* !< Analog supply (VDDA) as VR+ */
#define DAC12_CTL1_REFSP_VEREFP                  ((uint32_t)0x00000100U)         /* !< VEREFP pin as VR+ */
/* DAC12_CTL1[OPS] Bits */
#define DAC12_CTL1_OPS_OFS                       (24)                            /* !< OPS Offset */
#define DAC12_CTL1_OPS_MASK                      ((uint32_t)0x01000000U)         /* !< These bits select the DAC output on
                                                                                    device pin. */
#define DAC12_CTL1_OPS_NOC0                      ((uint32_t)0x00000000U)         /* !< No connect. Both DAC output
                                                                                    switches are open. */
#define DAC12_CTL1_OPS_OUT0                      ((uint32_t)0x01000000U)         /* !< OUT0 output is selected */
/* DAC12_CTL1[REFSN] Bits */
#define DAC12_CTL1_REFSN_OFS                     (9)                             /* !< REFSN Offset */
#define DAC12_CTL1_REFSN_MASK                    ((uint32_t)0x00000200U)         /* !< This bit selects the DAC voltage
                                                                                    reference source + input. */
#define DAC12_CTL1_REFSN_VEREFN                  ((uint32_t)0x00000000U)         /* !< VEREFN pin as VR- */
#define DAC12_CTL1_REFSN_VSSA                    ((uint32_t)0x00000200U)         /* !< Analog supply (VSSA) as VR- */
/* DAC12_CTL1[AMPHIZ] Bits */
#define DAC12_CTL1_AMPHIZ_OFS                    (1)                             /* !< AMPHIZ Offset */
#define DAC12_CTL1_AMPHIZ_MASK                   ((uint32_t)0x00000002U)         /* !< AMPHIZ - amplifier output value  0
                                                                                    : amplifier output is high impedance
                                                                                    1 : amplifier output is pulled down
                                                                                    to ground */
#define DAC12_CTL1_AMPHIZ_HIZ                    ((uint32_t)0x00000000U)         /* !< HiZ when disable */
#define DAC12_CTL1_AMPHIZ_PULLDOWN               ((uint32_t)0x00000002U)         /* !< dacout pulldown when disable */

/* DAC12_CTL2 Bits - DAC控制寄存器2(FIFO/触发/DMA配置) */
/* DAC12_CTL2[FIFOEN] Bits - FIFO使能 */
#define DAC12_CTL2_FIFOEN_OFS                    (0)                             /* !< FIFOEN Offset */
#define DAC12_CTL2_FIFOEN_MASK                   ((uint32_t)0x00000001U)         /* !< This bit enables the FIFO and the
                                                                                    FIFO hardware control state machine. */
#define DAC12_CTL2_FIFOEN_CLR                    ((uint32_t)0x00000000U)         /* !< FIFO is disabled */
#define DAC12_CTL2_FIFOEN_SET                    ((uint32_t)0x00000001U)         /* !< FIFO is enabled */
/* DAC12_CTL2[FIFOTH] Bits - FIFO阈值设置(触发DMA/中断的水位) */
#define DAC12_CTL2_FIFOTH_OFS                    (8)                             /* !< FIFOTH Offset */
#define DAC12_CTL2_FIFOTH_MASK                   ((uint32_t)0x00000300U)         /* !< These bits determine the FIFO
                                                                                    threshold. In case of DMA based
                                                                                    operation, DAC generates new DMA
                                                                                    trigger when the number of empty
                                                                                    locations in FIFO match the selected
                                                                                    FIFO threshold level.  In case of CPU
                                                                                    based operation, the FIFO threshold
                                                                                    bits are don't care and FIFO level is
                                                                                    directly indicated through the
                                                                                    respective bits in the RIS register. */
#define DAC12_CTL2_FIFOTH_LOW                    ((uint32_t)0x00000000U)         /* !< One fourth of the FIFO locations
                                                                                    are empty */
#define DAC12_CTL2_FIFOTH_MED                    ((uint32_t)0x00000100U)         /* !< Half of the FIFO locations are
                                                                                    empty */
#define DAC12_CTL2_FIFOTH_HIGH                   ((uint32_t)0x00000200U)         /* !< Three fourth of the FIFO locations
                                                                                    are empty */
#define DAC12_CTL2_FIFOTH_SPARE                  ((uint32_t)0x00000300U)         /* !< Reserved value. Defaults to same
                                                                                    effect as FIFOTH = 0 (One fourth of
                                                                                    the FIFO locations are empty). */
/* DAC12_CTL2[FIFOTRIGSEL] Bits */
#define DAC12_CTL2_FIFOTRIGSEL_OFS               (16)                            /* !< FIFOTRIGSEL Offset */
#define DAC12_CTL2_FIFOTRIGSEL_MASK              ((uint32_t)0x00030000U)         /* !< These bits select the source for
                                                                                    FIFO read trigger. When the selected
                                                                                    FIFO read trigger is asserted, the
                                                                                    data from FIFO (as indicated by read
                                                                                    pointer) is moved into internal DAC
                                                                                    data register. */
#define DAC12_CTL2_FIFOTRIGSEL_STIM              ((uint32_t)0x00000000U)         /* !< Sample time generator output */
#define DAC12_CTL2_FIFOTRIGSEL_TRIG0             ((uint32_t)0x00010000U)         /* !< Hardware trigger-0 from event
                                                                                    fabric */
#define DAC12_CTL2_FIFOTRIGSEL_SPARE1            ((uint32_t)0x00020000U)         /* !< Reserved - unimplemented */
#define DAC12_CTL2_FIFOTRIGSEL_SPARE2            ((uint32_t)0x00030000U)         /* !< Reserved - unimplemented */
/* DAC12_CTL2[DMATRIGEN] Bits - DMA触发使能 */
#define DAC12_CTL2_DMATRIGEN_OFS                 (24)                            /* !< DMATRIGEN Offset */
#define DAC12_CTL2_DMATRIGEN_MASK                ((uint32_t)0x01000000U)         /* !< This bit enables the DMA trigger
                                                                                    generation mechanism. When this bit
                                                                                    is set along with FIFOEN, the DMA
                                                                                    trigger is generated based on the
                                                                                    empty FIFO locations qualified by
                                                                                    FIFOTH settings. This bit should be
                                                                                    cleared by software to stop further
                                                                                    DMA triggers. */
#define DAC12_CTL2_DMATRIGEN_CLR                 ((uint32_t)0x00000000U)         /* !< DMA trigger generation mechanism is
                                                                                    disabled */
#define DAC12_CTL2_DMATRIGEN_SET                 ((uint32_t)0x01000000U)         /* !< DMA trigger generation mechanism is
                                                                                    enabled */

/* DAC12_CTL3 Bits - DAC控制寄存器3(波形生成/阶梯配置) */
/* DAC12_CTL3[STIMEN] Bits - 阶梯波生成使能 */
#define DAC12_CTL3_STIMEN_OFS                    (0)                             /* !< STIMEN Offset */
#define DAC12_CTL3_STIMEN_MASK                   ((uint32_t)0x00000001U)         /* !< This bit enables the sample time
                                                                                    generator. */
#define DAC12_CTL3_STIMEN_CLR                    ((uint32_t)0x00000000U)         /* !< Sample time generator is disabled */
#define DAC12_CTL3_STIMEN_SET                    ((uint32_t)0x00000001U)         /* !< Sample time generator is enabled */
/* DAC12_CTL3[STIMCONFIG] Bits */
#define DAC12_CTL3_STIMCONFIG_OFS                (8)                             /* !< STIMCONFIG Offset */
#define DAC12_CTL3_STIMCONFIG_MASK               ((uint32_t)0x00000F00U)         /* !< These bits are used to configure
                                                                                    the trigger rate from the sample time
                                                                                    generator. The STIMCONFIG values 10
                                                                                    to 15 are reserved and default to
                                                                                    same effect as value 0 (500SPS). */
#define DAC12_CTL3_STIMCONFIG__500SPS            ((uint32_t)0x00000000U)         /* !< Trigger rate is 500 sps (clock
                                                                                    divide value is 4000) */
#define DAC12_CTL3_STIMCONFIG__1KSPS             ((uint32_t)0x00000100U)         /* !< Trigger rate is 1 ksps (clock
                                                                                    divide value is 2000) */
#define DAC12_CTL3_STIMCONFIG__2KSPS             ((uint32_t)0x00000200U)         /* !< Trigger rate is 2 ksps (clock
                                                                                    divide value is 1000) */
#define DAC12_CTL3_STIMCONFIG__4KSPS             ((uint32_t)0x00000300U)         /* !< Trigger rate is 4 ksps (clock
                                                                                    divide value is 500) */
#define DAC12_CTL3_STIMCONFIG__8KSPS             ((uint32_t)0x00000400U)         /* !< Trigger rate is 8 ksps (clock
                                                                                    divide value is 250) */
#define DAC12_CTL3_STIMCONFIG__16KSPS            ((uint32_t)0x00000500U)         /* !< Trigger rate is 16 ksps (clock
                                                                                    divide value is 125) */
#define DAC12_CTL3_STIMCONFIG__100KSPS           ((uint32_t)0x00000600U)         /* !< Trigger rate is 100 ksps (clock
                                                                                    divide value is 20) */
#define DAC12_CTL3_STIMCONFIG__200KSPS           ((uint32_t)0x00000700U)         /* !< Trigger rate is 200 ksps (clock
                                                                                    divide value is 10) */
#define DAC12_CTL3_STIMCONFIG__500KSPS           ((uint32_t)0x00000800U)         /* !< Trigger rate is 500 ksps (clock
                                                                                    divide value is 4) */
#define DAC12_CTL3_STIMCONFIG__1MSPS             ((uint32_t)0x00000900U)         /* !< Trigger rate is 1 Msps (clock
                                                                                    divide value is 2) */

/* DAC12_CALCTL Bits */
/* DAC12_CALCTL[CALON] Bits */
#define DAC12_CALCTL_CALON_OFS                   (0)                             /* !< CALON Offset */
#define DAC12_CALCTL_CALON_MASK                  ((uint32_t)0x00000001U)         /* !< This bit when set initiates the DAC
                                                                                    offset error calibration sequence and
                                                                                    is automatically reset when the
                                                                                    offset error calibration completes. */
#define DAC12_CALCTL_CALON_INACTIVE              ((uint32_t)0x00000000U)         /* !< Offset error calibration is not
                                                                                    active */
#define DAC12_CALCTL_CALON_ACTIVE                ((uint32_t)0x00000001U)         /* !< Initiate offset error calibration
                                                                                    or offset error calibration is
                                                                                    already in progress */
/* DAC12_CALCTL[CALSEL] Bits */
#define DAC12_CALCTL_CALSEL_OFS                  (1)                             /* !< CALSEL Offset */
#define DAC12_CALCTL_CALSEL_MASK                 ((uint32_t)0x00000002U)         /* !< This bit is used to select between
                                                                                    factory trim or self calibration
                                                                                    trim. */
#define DAC12_CALCTL_CALSEL_FACTORYTRIM          ((uint32_t)0x00000000U)         /* !< Factory Trim Calibration Values are
                                                                                    used when calibration is enabled */
#define DAC12_CALCTL_CALSEL_SELFCALIBRATIONTRIM  ((uint32_t)0x00000002U)         /* !< Self Calibration Trim Values are
                                                                                    used when calibration is enabled */

