zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_dac12.h
/* DAC12_CALDATA Bits */
/* DAC12_CALDATA[DATA] Bits */
#define DAC12_CALDATA_DATA_OFS                   (0)                             /* !< DATA Offset */
#define DAC12_CALDATA_DATA_MASK                  ((uint32_t)0x0000007FU)         /* !< DAC offset error calibration data.
                                                                                    The DAC offset error calibration data
                                                                                    is represented in twos complement
                                                                                    format providing a range of 64 to
                                                                                    +63. This is read-only bit,
                                                                                    reflecting the calibration data.
                                                                                    Writing to this register will have no
                                                                                    effect, it will not change the
                                                                                    calibration value. */

/* DAC12_DATA0 Bits - DAC数据输出寄存器(写入值经DAC转换为模拟电压) */
/* DAC12_DATA0[DATA_VALUE] Bits */
#define DAC12_DATA0_DATA_VALUE_OFS               (0)                             /* !< DATA_VALUE Offset */
#define DAC12_DATA0_DATA_VALUE_MASK              ((uint32_t)0x00000FFFU)         /* !< This is the data written for
                                                                                    digital to analog conversion. */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_dac12__include */
